{
    "meta": {
        "tags": ["eCommerce", "SaaS", "Responsive design", "Apps"],
        "role": ["Wireframing", "Prototyping", "Style Guide", "UI", "UX"],
        "videoPath": [""]
    },
    "intro": {
        "project": "Webstore Editor",
        "title": "Empowering retailers to customize their <span class=\"no-wrap\">e-commerce</span> website",
        "subtitle": "Loosing high-performing shops to competitors",
        "section": "context",
        "text": ["All retailers using CommentSold are provided with an <span class=\"no-wrap\">e-commerce</span> website and native app as part of their plan.", "We were starting to lose some of our highest-earning shops to competitors because the website and editing tools were below par.", "Along with this, hundreds of new shops were being onboarded each month with a solution that is below competitor standards."]
    },
    "process": {
        "section": "process",
        "sectionTitle": "Setting up for success",
        "text": ["The team knew that our solution had to improve for both retailers and their end customers.", "We needed to release a meaningful iteration to win back shops that left and give new shops the best chance at success.", "A <a href=\"https://www.interaction-design.org/literature/article/a-simple-introduction-to-lean-ux\" target=\"_blank\" class=\"folio-link no-wrap\">Lean UX</a> approach to the project was taken; the teams weren't working to 'requirements' and 'deliverables' but collaborated around a core problem statement and a set of assumptions.", "I created some Lean UX artifacts to help the cross-functional teams as guiding references over project lifecycle."],
        "diagramMVP": "https://folio22.s3.amazonaws.com/webstore/mvp-pyramid.png",
        "diagramMVPalt": "Diagram of MVP pyramid",
        "diagramMVPcaption": "The Minimum Viable Product (MVP) had to satisfy many levels of user needs",
        "diagramMVPFigmaLink": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D78%253A8031",
        "diagramLeanUX": "https://folio22.s3.amazonaws.com/webstore/lean-ux-canvas.png",
        "diagramLeanUXalt": "Diagram of Lean UX canvas",
        "diagramLeanUXcaption": "The Lean UX canvas is very helpful for a cross-functional team to focus on “why",
        "diagramLeanUXFigmaLink": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D77%253A7284"
    },
    "research": {
        "section": "research",
        "sectionTitle": "Understanding the 'current solution'",
        "text": ["The editing tools gave retailers some customization control but were not to the standard of competitors.", "Features were added as requests were received and a holistic review was really needed."],
        "webstoreClassic": "https://folio22.s3.amazonaws.com/webstore/classic-webstore.png",
        "webstoreClassicAlt": "Example of existing webstore design",
        "webstoreClassicCaption": "The existing webstore design was not a competitive offering for our retailers",
        "heuristic": "https://folio22.s3.amazonaws.com/webstore/heuristics-admin2.png",
        "heuristicAlt": "UI example of heuristics analysis",
        "heuristicCaption": "Heuristics analysis of existing webstore editor",
        "heuristicFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D13%253A17803"
    },
    "ideation": {
        "section": "ideation",
        "sectionTitle": "Consolidate my understanding, explore viewpoints", 
        "textHMW": ["Before getting in to solutions, crafting a ‘HMW…’ question helps me think about the problem space.", "It’s easy to drift off course and not fully action the right insights or problems.", "It’s also important the ‘HMW…’ is broad enough to allow for sufficient exploration of ideas at the early stage of the project.", "Typically, I initiate this process and invite contribution from the team so it guides the ideas that follow."],
        "hmw": "...empower newly onboarded and existing retailers to easily and regularly customize their Webstore so as to fully leverage it as a marketing and selling tool ?", 
        "titleCardSort": "Card sort title",
        "textCardSort": ["A significant part of the problem I had to consider was Shopify’s dominance in this e-comm space.", "Many of our top retailers wanted to drop Shopify and just use CommentSold. The standard of both our Webstore and editing tools were just not sufficient to compete.", "It was important for me to review Shopify’s solution for editing tools and try achieve a significant step forward within our the time and budget constraints."],      
        "cardSort": "https://folio22.s3.amazonaws.com/webstore/card-sorting-features-cropped.png",
        "cardSortAlt": "Card sorting of features",
        "cardSortCaption": "Card sorting of features for 'classic' and new webstore editor",
        "cardSortFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FH4y0XL1ji8HemtpXL6E58m%2Ffolio22-Webstore-Editor-card-sorting%3Fnode-id%3D31%253A440"}, 
    "wireframing": {
        "section": "wireframing",
        "sectionTitle": "'Laddering' the resolutions of the wireframes'",
        "text": ["At this stage of the project I had an abundance of references - feature requests from Shops, existing features on the admin, JSON config files, notes from interviews with Shop owners.", "There were many suggestions from within the team of additional features we could add. I needed a simple overview of what’s already built, what we’re keeping for v2, and what’s going to be new.", "A simple sticky on a (virtual) whiteboard served the purpose of a quick and easy overview."],
        "heuristics": ["It is helpful to conduct a quick audit of the current solution based on general principles of interaction design.", "Each issue is ranked on a level of importance and urgency to fix. This is a good reference throughout the lifecycle of the project to ensure I catch glaring UX issues before the next version ships."],
        "titlePixelUnion": "Pixel Union title",
        "textPixelUnion": ["PixelUnion, an agency that specializes in Shopify templates, was hired to build out the core e-commerce storefront - landing pages, product search, product detail pages.", "Existing and new APIs had to capture all relevant logic and data of live-selling and product life-cycle and be accurately rendered in these templates.", "We quickly realized that including the checkout flow in this iteration would increase scope too much.", "My task was to lead Product Design for the editing tools of the new Webstore on the CommentSold platform.", "PixelUnion did make some suggestions for the editor that would be a simple extension of existing tools.", "I saw opportunity for a better user experience and pushed to explore alternatives."], 
        "wirePixelUnion": "https://folio22.s3.amazonaws.com/webstore/pxu-admin2.jpg",
        "wirePixelUnionAlt": "Pixel Union wireframe of editor",
        "wirePixelUnionCaption": "Pixel Union wireframe of editor",
        "titleWireframes": "Title for wireframes",
        "textWireframes": ["From early wireframes I was drawn to the idea of users immediately seeing the ‘results’ of editing.", "I presented some early mock-ups to the CTO, VP Engineering and Product Manager; all of them saw the idea as viable and worth pursuing.", "I also initially drafted wireframes as mobile-first, since checkout from the iOS and Android apps was the core funnel.", "Although the end-result was not mobile-first, the new editor and webstore templates were fully responsive."],
        "wireAllTools": "https://folio22.s3.amazonaws.com/webstore/wires-editor-all-tools.png",
        "wireAllToolsAlt": "Alt text for image",
        "wireMobile": "https://folio22.s3.amazonaws.com/webstore/wires-editor-mobile.png",
        "wireMobileAlt": "Alt text for image",
        "wiresCaption": "Caption for wireframes",
        "wiresFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FI1ksiK2HeHBcyMH1nam81Y%2FFolio22-Webstore-Editor%3Fnode-id%3D11%253A24669",
        "titleAppFlow": "Title for switching back from classic to new",
        "textAppFlow": ["This is a sample paragraph with lots of words and it should be long enough to expand the container box."],
        "appFlow": "https://folio22.s3.amazonaws.com/webstore/app-flow-classic-to-new.png",
        "appFlowAlt": "App flow alt",
        "appFlowCaption": "App flow caption",
        "appFlowFigma": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FxhDF7sor1ix8AEaa0eVDH5%2Ffolio22-Classic-to-New-Webstore%3Fnode-id%3D1%253A946"
        },
    "designs": {
        "section": "designs",
        "sectionTitle": "User interface design",
        "text": ["Most of my time was used in designing task flows for the many editor tools.", "Each tool had its own interaction, but all tools had to have a strong consistency in styling and interaction.", "I continued to increase the resolution from low-res wireframes to high-res polished designs.", "There was daily collaboration with Product, Engineering, and QA in shaping the design to the point where the team was fully confident in what the next major release was going be.", "Scope, features, ideas all shifted and changed throughout this stage, but having that visual expression was crucial in all decision making."],
        "flowTitle": "Title for flowchart",
        "flow": ["Many of our top retailers were already using Webstore v1 and had hired external agencies to customize our core template to meet their marketing needs.", "We had consulted with a lot of these shops before beginning the project. It was crucial to enable shops to switch between v1 and v2 as they see fit.", "This had many implications on the different features and UI for both the editor and Webstore. I had to problem-solve using diagrams so the team could clearly understand how shops could fulfill this need.", "I created an application flow diagram showing how shops can toggle between v1 and v2.", "Along with the flow diagram I created screenflow options and recorded walkthroughs of prototypes so we could fine-tune a solution."],
        "designStart": "https://folio22.s3.amazonaws.com/dcl/design-start.png",
        "designStartAlt": "Alt for design start page",
        "designDash": "https://folio22.s3.amazonaws.com/dcl/design-live-dash.png",
        "designDashAlt": "Alt for design dash",
        "designsFigmaLink": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FBr1YJTU9Hy5VOr8e0bHr5K%2FFolio22-Decoupled-Live%3Fnode-id%3D1995%253A21909"},
    "delivery": {
        "section": "delivery",
        "sectionTitle": "Collaborating with engineers",
        "text": ["There was a lot of shifting and changing scope on this project.", "The CommentSold platform is feature rich and there are a lot of nuanced considerations - like First-Person-First-Served (FPFS) and comment-harvesting from Facebook - all had some influence on the Webstore and editing tools.", "A lot of communication had to take place between internal and external teams to ensure the tooling and templates and edge-cases were all syncronized.", "My admin editor designs were also crucial in guiding PixelUnion on developing components to be customizable."],
        "release": ["I collaborated on this project from end-to-end; the initial scoping and framing of the problem space to the QA testing and release plan.", "We tested with a small selection of shops from different cohorts - newly onboarded to top sellers by volume.", "As all our shops were aware and awaiting the release, we couldn’t be seen to be giving competitive advantage to the selected few.", "I put together a basic framework for releasing this project and future projects also."],
        "imgStyleGuide": "https://folio22.s3.amazonaws.com/dcl/dcl-style-guide-cropped.png",
        "imgStyleGuideAlt": "Alt for this image",
        "figmaStyleGuide": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FBr1YJTU9Hy5VOr8e0bHr5K%2FFolio22-Decoupled-Live%3Fnode-id%3D3278%253A16699"
    },
    "validation": {
        "section": "validation",
        "sectionTitle": "First version release",
        "text": ["CommentSold had several Facebook Groups available for different cohorts of retailers based on volume of sales.", "This was a great way to get regular feedback from end-users at each major step of the project."],
        "imgShutterPost": "https://folio22.s3.amazonaws.com/dcl/dcl-shutterfly-fb-post.jpg",
        "imgShutterPostAlt": "Alt text",
        "imgShutterComment": "https://folio22.s3.amazonaws.com/dcl/dcl-shutterfly-fb-comments.jpg",
        "imgShutterCommentAlt": "Alt text"
    },
    "outcomes": {
        "section": "outcomes",
        "sectionTitle": "Some results",
        "text": ["Within 60 days of general release, all of the key metrics were showing v2 to be successful.", "Some YOY metrics were skewed due to COVID, but still pointed to high confidence that v2 would continue to out-perform v1.", "Quantitative feedback was very positive across all cohorts.", "New shops were automatically onboarded with v2 Webstore."]
    },
    "retrospective": {
        "section": "retrospective",
        "sectionTitle": "What could I have done better ?",
        "text": ["Here's a temporary sentence to expand the width of the container element which is HTML by the way and these are a lot of words that don't make a sensible sentece."],
        "link": "https://www.videeo.live"
    },
    "snippets": {
        "1": ["Empowering our retailers to customize their primary marketing tools - their fully responsive e-commerce website"]
    }
}